In [1]:
import pandas as pd
import numpy as np

In [2]:
l = [1,2,3,4]
d= {'a':80,'b':77,'c':99,'d':44}
arr = np.array([77,66,55,99])
nm = 'a b c d'.split()

In [3]:
nm

['a', 'b', 'c', 'd']

In [4]:
s=pd.Series(data=l,index=nm)

In [5]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
s[0]

1

In [7]:
s['a']

1

In [8]:
s=s+10

In [10]:
s>12

a    False
b    False
c     True
d     True
dtype: bool

In [11]:
s[s>12]

c    13
d    14
dtype: int64

In [12]:
s

a    11
b    12
c    13
d    14
dtype: int64

In [16]:
d={'a': 80, 'b': 77, 'c': 99, 'e': np.NaN}

In [17]:
s1 = pd.Series(d)

In [18]:
s1

a    80.0
b    77.0
c    99.0
e     NaN
dtype: float64

In [15]:
s1 + s

a     91.0
b     89.0
c    112.0
d      NaN
e      NaN
dtype: float64

In [27]:
s1

a    80
b    77
c    99
e    44
dtype: int64

In [29]:
s

a    11
b    12
c    13
d    14
dtype: int64

In [19]:
s2= pd.Series([1,1,1,2,2,2,3,3,3,4,4,4,4,5,5])

In [20]:
s2

0     1
1     1
2     1
3     2
4     2
5     2
6     3
7     3
8     3
9     4
10    4
11    4
12    4
13    5
14    5
dtype: int64

In [21]:
s2.unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [22]:
s2.nunique()

5

In [26]:
s2.value_counts()

4    4
3    3
2    3
1    3
5    2
dtype: int64

In [25]:
s2.value_counts().to_dict()

{1: 3, 2: 3, 3: 3, 4: 4, 5: 2}

In [27]:
nm

['a', 'b', 'c', 'd']

In [28]:
l

[1, 2, 3, 4]

In [30]:
dict(zip(nm,l))

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [24]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [47]:
s

a    11
b    12
c    13
d    14
dtype: int64

In [34]:
arr= np.random.randint(1,100,9).reshape(3,3)

In [35]:
arr

array([[96, 12, 82],
       [71, 64, 88],
       [76, 10, 78]])

In [36]:
np.random.seed(101)

In [40]:
df = pd.DataFrame(data=arr,columns=['id','sal','bonus'],index='a b c'.split())

In [41]:
df

   id  sal  bonus
a  96   12     82
b  71   64     88
c  76   10     78

In [2]:
d = {'id':[1,2,3,4],'nm':'aa bb cc dd'.split(),'prom':[True,True,False,False]}

In [3]:
d

{'id': [1, 2, 3, 4],
 'nm': ['aa', 'bb', 'cc', 'dd'],
 'prom': [True, True, False, False]}

In [4]:
df2 = pd.DataFrame(d)

In [7]:
df2.set_index('nm',inplace=True)

In [9]:
df2.rename(index={'aa':'pp'})

    id   prom
nm
pp   1   True
bb   2   True
cc   3  False
dd   4  False

In [46]:
df3 = pd.DataFrame()

In [51]:
df3

   id nm
0   9  n
1   8  b
2   7  v
3   6  g

In [48]:
df3['id'] = [9,8,7,6]

In [50]:
df3['nm'] = 'n b v g'.split()

In [52]:
df.head(2)

   id  sal  bonus
a  96   12     82
b  71   64     88

In [53]:
df.tail(1)

   id  sal  bonus
c  76   10     78

In [55]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
id    4 non-null int64
nm    4 non-null object
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [57]:
df2.describe(percentiles=[.01,.1,.2,.9,.95,.99],include='all')

              id   nm  prom
count   4.000000    4     4
unique       NaN    4     2
top          NaN   cc  True
freq         NaN    1     2
mean    2.500000  NaN   NaN
std     1.290994  NaN   NaN
min     1.000000  NaN   NaN
1%      1.030000  NaN   NaN
10%     1.300000  NaN   NaN
20%     1.600000  NaN   NaN
50%     2.500000  NaN   NaN
90%     3.700000  NaN   NaN
95%     3.850000  NaN   NaN
99%     3.970000  NaN   NaN
max     4.000000  NaN   NaN

In [58]:
df2.transpose()

         0     1      2      3
id       1     2      3      4
nm      aa    bb     cc     dd
prom  True  True  False  False

In [59]:
df

   id  sal  bonus
a  96   12     82
b  71   64     88
c  76   10     78

In [62]:
df.shape[1]

3

In [66]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [67]:
df.columns

Index(['id', 'sal', 'bonus'], dtype='object')

In [69]:
df[['id']]

   id
a  96
b  71
c  76

In [70]:
df.id

a    96
b    71
c    76
Name: id, dtype: int32

In [71]:
df[['id','bonus']]

   id  bonus
a  96     82
b  71     88
c  76     78

In [72]:
df

   id  sal  bonus
a  96   12     82
b  71   64     88
c  76   10     78

In [79]:
df.iloc[2,:]

id       76
sal      10
bonus    78
Name: c, dtype: int32

In [80]:
df.loc['c',['id','bonus']]

id       76
bonus    78
Name: c, dtype: int32

In [82]:
df['gender'] = 'm m f'.split()

In [83]:
df

   id  sal  bonus gender
a  96   12     82      m
b  71   64     88      m
c  76   10     78      f

In [87]:
df.drop('bonus',axis=1,inplace=True)

In [90]:
df.drop(['id','gender'],axis=1,inplace=True)

In [93]:
df.drop('c')

   sal
a   12
b   64

In [97]:
df2.columns = ['emp id','name','promotion']

In [102]:
df2

   emp id name  promo
0       1   aa   True
1       2   bb   True
2       3   cc  False
3       4   dd  False

In [101]:
df2.rename(columns={'promotion':'promo'},inplace=True)

In [103]:
df2['sal'] = [10,20,30,20]

In [104]:
df2['bonus'] =[.1,.2,.1,.3]

In [105]:
df2

   emp id name  promo  sal  bonus
0       1   aa   True   10    0.1
1       2   bb   True   20    0.2
2       3   cc  False   30    0.1
3       4   dd  False   20    0.3

In [106]:
df2['total'] = df2['sal'] + df2['sal']*df2['bonus']

In [107]:
df2

   emp id name  promo  sal  bonus  total
0       1   aa   True   10    0.1   11.0
1       2   bb   True   20    0.2   24.0
2       3   cc  False   30    0.1   33.0
3       4   dd  False   20    0.3   26.0

In [110]:
df2['sal']*df2['bonus']

0    1.0
1    4.0
2    3.0
3    6.0
dtype: float64

In [111]:
df2['email'] = 'aa@gmail.com bbb@yahoo.com cccc@aol.com q@outlokk.com'.split()

In [112]:
df2

   emp id name  promo  sal  bonus  total          email
0       1   aa   True   10    0.1   11.0   aa@gmail.com
1       2   bb   True   20    0.2   24.0  bbb@yahoo.com
2       3   cc  False   30    0.1   33.0   cccc@aol.com
3       4   dd  False   20    0.3   26.0  q@outlokk.com

In [113]:
def fun(x):
    return(x.split('@')[0])

In [115]:
fun('yyyyyyyy@yahoo.com')

'yyyyyyyy'

In [116]:
df2['domain'] = df2['email'].apply(fun)

In [117]:
df2

   emp id name  promo  sal  bonus  total          email domain
0       1   aa   True   10    0.1   11.0   aa@gmail.com     aa
1       2   bb   True   20    0.2   24.0  bbb@yahoo.com    bbb
2       3   cc  False   30    0.1   33.0   cccc@aol.com   cccc
3       4   dd  False   20    0.3   26.0  q@outlokk.com      q

In [118]:
def fun(x):
    return(x.split('@')[1].split('.')[0])

In [121]:
df2['domain1'] = df2['email'].apply(lambda x : x.split('@')[1].split('.')[0])

In [123]:
df2['len'] = df2['email'].apply(lambda x : len(x))

In [124]:
df2

   emp id name  promo  sal  bonus  total          email domain  domain1  len
0       1   aa   True   10    0.1   11.0   aa@gmail.com     aa    gmail   12
1       2   bb   True   20    0.2   24.0  bbb@yahoo.com    bbb    yahoo   13
2       3   cc  False   30    0.1   33.0   cccc@aol.com   cccc      aol   12
3       4   dd  False   20    0.3   26.0  q@outlokk.com      q  outlokk   13

In [125]:
df2['out'] = df2['total'].apply(lambda x : 1 if x > 30 else 0)

In [129]:
df2['sal_log'] = np.log(df2['sal'])

In [130]:
df2

,emp id,name,promo,sal,bonus,total,email,domain,domain1,len,out,sal_log
0,1,aa,True,10,0.1,11.0,aa@gmail.com,aa,gmail,12,0,2.302585
1,2,bb,True,20,0.2,24.0,bbb@yahoo.com,bbb,yahoo,13,0,2.995732
2,3,cc,False,30,0.1,33.0,cccc@aol.com,cccc,aol,12,1,3.401197
3,4,dd,False,20,0.3,26.0,q@outlokk.com,q,outlokk,13,0,2.995732

In [134]:
df2['name'].dtype == 'O'

True

In [135]:
cat = []
num = []
for i in df2.columns:
    if df2[i].dtype == 'O':
        cat.append(i)
    else:
        num.append(i)

In [136]:
cat

['name', 'email', 'domain', 'domain1']

In [137]:
num

['emp id', 'promo', 'sal', 'bonus', 'total', 'len', 'out', 'sal_log']

In [138]:
df2.describe()

         emp id        sal     bonus      total       len   out   sal_log
count  4.000000   4.000000  4.000000   4.000000   4.00000  4.00  4.000000
mean   2.500000  20.000000  0.175000  23.500000  12.50000  0.25  2.923812
std    1.290994   8.164966  0.095743   9.183318   0.57735  0.50  0.456130
min    1.000000  10.000000  0.100000  11.000000  12.00000  0.00  2.302585
25%    1.750000  17.500000  0.100000  20.750000  12.00000  0.00  2.822445
50%    2.500000  20.000000  0.150000  25.000000  12.50000  0.00  2.995732
75%    3.250000  22.500000  0.225000  27.750000  13.00000  0.25  3.097099
max    4.000000  30.000000  0.300000  33.000000  13.00000  1.00  3.401197

In [144]:
df2[(df2['domain'] == 'q') | (df2['bonus'] > .3)]

,emp id,name,promo,sal,bonus,total,email,domain,domain1,len,out,sal_log
3,4,dd,False,20,0.3,26.0,q@outlokk.com,q,outlokk,13,0,2.995732

In [146]:
df2[df2['bonus']> .1]

,emp id,name,promo,sal,bonus,total,email,domain,domain1,len,out,sal_log
1,2,bb,True,20,0.2,24.0,bbb@yahoo.com,bbb,yahoo,13,0,2.995732
3,4,dd,False,20,0.3,26.0,q@outlokk.com,q,outlokk,13,0,2.995732

In [10]:
df = pd.DataFrame(np.random.randn(4,4),columns = 'a b c d'.split())

In [11]:
df2= df[df>0]

In [12]:
df2

          a         b         c         d
0       NaN  0.748541  0.542981  0.809848
1       NaN       NaN  1.473713  0.344144
2       NaN       NaN  0.246292       NaN
3  0.731237       NaN  0.701874  1.307108

In [13]:
s = df2.isnull().sum()/df2.shape[0]

In [14]:
s

a    0.75
b    0.75
c    0.00
d    0.25
dtype: float64

In [15]:
list(s[s> .3].index)

['a', 'b']

In [164]:
df2.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [166]:
df2.fillna(0)

          a         b         c         d
0  2.706850  0.628133  0.907969  0.503826
1  0.651118  0.000000  0.000000  0.605965
2  0.000000  0.740122  0.528813  0.000000
3  0.188695  0.000000  0.000000  0.955057

In [169]:
df2['a'].fillna(np.mean(df2['a']),inplace=True)

In [170]:
df2

          a         b         c         d
0  2.706850  0.628133  0.907969  0.503826
1  0.651118       NaN       NaN  0.605965
2  1.182221  0.740122  0.528813       NaN
3  0.188695       NaN       NaN  0.955057

In [172]:
df['name'] = 'x y z w'.split()

In [173]:
df

          a         b         c         d name
0  2.706850  0.628133  0.907969  0.503826    x
1  0.651118 -0.319318 -0.848077  0.605965    y
2 -2.018168  0.740122  0.528813 -0.589001    z
3  0.188695 -0.758872 -0.933237  0.955057    w

In [190]:
df.set_index('name',inplace=True)

In [191]:
df.index

Index(['x', 'y', 'z', 'w'], dtype='object', name='name')

In [192]:
df

      level_0  index         a         b         c         d
name
x           0      0  2.706850  0.628133  0.907969  0.503826
y           1      1  0.651118 -0.319318 -0.848077  0.605965
z           2      2 -2.018168  0.740122  0.528813 -0.589001
w           3      3  0.188695 -0.758872 -0.933237  0.955057

In [193]:
df.reset_index(inplace=True,drop=True)

In [194]:
df

   level_0  index         a         b         c         d
0        0      0  2.706850  0.628133  0.907969  0.503826
1        1      1  0.651118 -0.319318 -0.848077  0.605965
2        2      2 -2.018168  0.740122  0.528813 -0.589001
3        3      3  0.188695 -0.758872 -0.933237  0.955057

In [16]:
df = pd.DataFrame({'id':[1 ,1 ,1,2 ,2,2, 3, 3],'sal':[10 ,20 ,20,20,30 ,20 ,10, 10],'mon':['jan','jan','feb','jan','jan','feb','jan','feb']})

In [17]:
df

   id  mon  sal
0   1  jan   10
1   1  jan   20
2   1  feb   20
3   2  jan   20
4   2  jan   30
5   2  feb   20
6   3  jan   10
7   3  feb   10

In [26]:
df11 = pd.pivot_table(df,index='id',columns='mon',values='sal',aggfunc=[np.sum,np.std,np.min,np.max])

In [27]:
df11

    sum           std amin     amax
mon feb jan       jan  feb jan  feb jan
id
1    20  30  7.071068   20  10   20  20
2    20  50  7.071068   20  20   20  30
3    10  10       NaN   10  10   10  10

In [28]:
df['bon'] = df['sal']*10

In [29]:
df

   id  mon  sal  bon
0   1  jan   10  100
1   1  jan   20  200
2   1  feb   20  200
3   2  jan   20  200
4   2  jan   30  300
5   2  feb   20  200
6   3  jan   10  100
7   3  feb   10  100

In [32]:
df.groupby('id').agg(['sum','mean'])

   sal             bon
   sum       mean  sum        mean
id
1   50  16.666667  500  166.666667
2   70  23.333333  700  233.333333
3   20  10.000000  200  100.000000

In [229]:
df.to_csv('test.csv',index=False)

In [232]:
df2 = pd.read_csv('test.csv',index_col=2)

In [233]:
df2

     id  mon  bon
sal
10    1  jan  100
20    1  jan  200
20    1  feb  200
20    2  jan  200
30    2  jan  300
20    2  feb  200
10    3  jan  100
10    3  feb  100

In [234]:
df.to_excel('test.xls')

In [235]:
df3 = pd.read_excel('test.xls')

In [236]:
df3

   id  mon  sal  bon
0   1  jan   10  100
1   1  jan   20  200
2   1  feb   20  200
3   2  jan   20  200
4   2  jan   30  300
5   2  feb   20  200
6   3  jan   10  100
7   3  feb   10  100

In [42]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        )

In [43]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         )

In [44]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                       )

In [45]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [46]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [47]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [52]:
pd.concat([df1,df2,df3]).reset_index(drop=True)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [73]:
d1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
d2 = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                          'A': ['C0', 'C1', 'C2', 'C3'],
                          'B': ['D0', 'D1', 'D2', 'D3']})

In [74]:
d1

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K4

In [75]:
d2

    A   B key1
0  C0  D0   K0
1  C1  D1   K1
2  C2  D2   K2
3  C3  D3   K3

In [77]:
pd.merge(d1,d2,left_on='key',right_on='key1',how='outer',suffixes=('_x', '_y'))

   A_x  B_x  key  A_y  B_y key1
0   A0   B0   K0   C0   D0   K0
1   A1   B1   K1   C1   D1   K1
2   A2   B2   K2   C2   D2   K2
3   A3   B3   K4  NaN  NaN  NaN
4  NaN  NaN  NaN   C3   D3   K3

In [82]:
d1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

d2 = pd.DataFrame({'A': ['C0', 'C2', 'C3'],
                    'B': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [83]:
d1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [84]:
d2

     A   B
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [88]:
d1.join(d2, rsuffix='_r')

     A   B  A_r  B_r
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [89]:
import numpy as np
import pandas as pd

In [91]:
ecom = pd.read_csv('Ecommerce Purchases')

In [92]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [93]:
ecom.shape

(10000, 14)

In [94]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [95]:
np.mean(ecom['Purchase Price'])

50.34730200000025

In [96]:
np.min(ecom['Purchase Price'])

0.0

In [97]:
np.max(ecom['Purchase Price'])

99.99

In [98]:
ecom['Language'].unique()

array(['el', 'fr', 'de', 'es', 'ru', 'pt', 'zh', 'en', 'it'], dtype=object)

In [100]:
ecom[ecom['Language']=='en'].shape[0]

1098

In [101]:
ecom[ecom['Job']=='Lawyer'].shape[0]

30

In [102]:
ecom['AM or PM'].unique()

array(['PM', 'AM'], dtype=object)

In [103]:
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [105]:
ecom['Job'].value_counts().head()

Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Designer, jewellery                  27
Research officer, political party    27
Name: Job, dtype: int64

In [106]:
ecom['Lot'].unique()

array(['46 in', '28 rn', '94 vE', ..., '74 Zh', '74 cL', '64 Hr'],
      dtype=object)

In [109]:
ecom[ecom['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [111]:
ecom[ecom['Credit Card'] == 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [112]:
ecom[(ecom['CC Provider'] == 'American Express') & (ecom['Purchase Price'] >95)].shape[0]

39

In [113]:
ecom['exp_yr'] = ecom['CC Exp Date'].apply(lambda x : int(x.split('/')[1]))

In [115]:
ecom[ecom['exp_yr'] == 25].shape[0]

1033